quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_tdc_regs.h
/*
 * mml_tdc_regs.h --
 *
 * ----------------------------------------------------------------------------
 * Copyright (c) 2013, Maxim Integrated Products
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of the <organization> nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY MAXIM INTEGRATED PRODUCTS ''AS IS'' AND ANY
 * EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL MAXIM INTEGRATED PRODUCTS BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
 * ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/* [INTERNAL] ------------------------------------------------------------------
 * Created on: Oct 22, 2013
 * Author: Yann G. <yann.gaude@maximintegrated.com>
 *
 * ---- Subversion keywords (need to set the keyword property)
 * $Revision:: $: Revision of last commit
 * $Author:: $: Author of last commit
 * $Date:: $: Date of last commit
 * [/INTERNAL] -------------------------------------------------------------- */

#ifndef _MML_TDC_REGS_H_
#define _MML_TDC_REGS_H_

/** @file mml_tdc_regs.h TDC Registers Header */

/** @defgroup MML_TDC TDC Driver
 * @ingroup MML_DRIVER
 */

/** @defgroup MML_TDC_REGS TDC Registers
 *
 * @note TDC IP or Specification version number
 *
 * @ingroup MML_TDC
 * @{
 */

/** @defgroup MML_TDC_REGS_CLKR  Clock Register (CLKR)
 *
 * @li CLKDIV [7:0] - R/W: clock divider -> pixel clock + 1
 * @li ACB [15:8] 	- R/W: AC bias frequency
 * @li DPOL [16] 	- R/W: video data enable polarity
 * @li VPOL [17] 	- R/W: vertical sync polarity
 * @li HPOL [18] 	- R/W: horizontal sync polarity
 * @li EDGE [19] 	- R/W: clock edge select
 * @li PASCLK [20] 	- R/W: clock mode : passive(for TFT)/active(for STN)
 * @li RFU1 [21] 	- R: reserved
 * @li VSCANDIR [22]- R/W: vertical scan direction
 * @li HSCANDIR [23]- R/W: horizontal scan direction
 * @li TESTEN[24]	- R/W: ????????
 * @li RFU2 [31:24] - R: reserved
 *
 * @{
 */

#define MML_TDC_CLKR_OFST						0x0 //!< Register offset
#define MML_TDC_CLKR_DFLT						0x0 //!< Register default value

/** Bits Fields */
#define MML_TDC_CLKR_CLKDIV_OFST				0 //!< CLKDIV offset
#define MML_TDC_CLKR_CLKDIV_MASK_NOOFST			0xff //!< CLKDIV mask
#define MML_TDC_CLKR_CLKDIV_MASK				( MML_TDC_CLKR_CLKDIV_MASK_NOOFST << MML_TDC_CLKR_CLKDIV_OFST ) //!< CLKDIV mask

#define MML_TDC_CLKR_ACB_OFST					8 //!< ACB offset
#define MML_TDC_CLKR_ACB_MASK_NOOFST			0xff //!< ACB mask
#define MML_TDC_CLKR_ACB_MASK					( MML_TDC_CLKR_ACB_MASK_NOOFST << MML_TDC_CLKR_ACB_OFST ) //!< ACB mask

#define MML_TDC_CLKR_DPOL_OFST					16 //!< DPOL offset
#define MML_TDC_CLKR_DPOL_MASK_NOOFST			0x1 //!< DPOL mask
#define MML_TDC_CLKR_DPOL_MASK					( MML_TDC_CLKR_DPOL_MASK_NOOFST << MML_TDC_CLKR_DPOL_OFST ) //!< DPOL mask

#define MML_TDC_CLKR_VPOL_OFST					17 //!< VPOL offset
#define MML_TDC_CLKR_VPOL_MASK_NOOFST			0x1 //!< VPOL mask
#define MML_TDC_CLKR_VPOL_MASK					( MML_TDC_CLKR_VPOL_MASK_NOOFST << MML_TDC_CLKR_VPOL_OFST ) //!< VPOL mask

#define MML_TDC_CLKR_HPOL_OFST					18 //!< HPOL offset
#define MML_TDC_CLKR_HPOL_MASK_NOOFST			0x1 //!< HPOL mask
#define MML_TDC_CLKR_HPOL_MASK					( MML_TDC_CLKR_HPOL_MASK_NOOFST << MML_TDC_CLKR_HPOL_OFST ) //!< HPOL mask

#define MML_TDC_CLKR_EDGE_OFST					19 //!< EDGE offset
#define MML_TDC_CLKR_EDGE_MASK_NOOFST			0x1 //!< EDGE mask
#define MML_TDC_CLKR_EDGE_MASK					( MML_TDC_CLKR_EDGE_MASK_NOOFST << MML_TDC_CLKR_EDGE_OFST ) //!< EDGE mask

#define MML_TDC_CLKR_PASCLK_OFST				20 //!< PASCLK offset
#define MML_TDC_CLKR_PASCLK_MASK_NOOFST			0x1 //!< PASCLK mask
#define MML_TDC_CLKR_PASCLK_MASK				( MML_TDC_CLKR_PASCLK_MASK_NOOFST << MML_TDC_CLKR_PASCLK_OFST ) //!< PASCLK mask

#define MML_TDC_CLKR_RFU1_OFST					21 //!< RFU offset
#define MML_TDC_CLKR_RFU1_MASK					0x200000 //!< RFU mask

#define MML_TDC_CLKR_VSCANDIR_OFST				22 //!< VSCANDIR offset
#define MML_TDC_CLKR_VSCANDIR_MASK_NOOFST		0x1 //!< VSCANDIR mask
#define MML_TDC_CLKR_VSCANDIR_MASK				( MML_TDC_CLKR_VSCANDIR_MASK_NOOFST << MML_TDC_CLKR_VSCANDIR_OFST ) //!< VSCANDIR mask

#define MML_TDC_CLKR_HSCANDIR_OFST				23 //!< HSCANDIR offset
#define MML_TDC_CLKR_HSCANDIR_MASK_NOOFST		0x1 //!< HSCANDIR mask
#define MML_TDC_CLKR_HSCANDIR_MASK				( MML_TDC_CLKR_HSCANDIR_MASK_NOOFST << MML_TDC_CLKR_HSCANDIR_OFST ) //!< HSCANDIR mask

#define MML_TDC_CLKR_TESTEN_OFST				24 //!< TESTEN offset
#define MML_TDC_CLKR_TESTEN_MASK_NOOFST			0x1 //!< TESTEN mask
#define MML_TDC_CLKR_TESTEN_MASK				( MML_TDC_CLKR_TESTEN_MASK_NOOFST << MML_TDC_CLKR_TESTEN_OFST ) //!< TESTEN mask

#define MML_TDC_CLKR_RFU2_OFST					25 //!< RFU offset
#define MML_TDC_CLKR_RFU2_MASK					0xfe000000 //!< RFU mask



/** Enumeration of the different value for a bits field  */
#define MML_TDC_CLKR_DPOL_LOW					0 //!< video data enable active low
#define MML_TDC_CLKR_DPOL_HIGH					1 //!< video data enable active high
#define MML_TDC_CLKR_VPOL_LOW					0 //!< VSYNC active low
#define MML_TDC_CLKR_VPOL_HIGH					1 //!< VSYNC active high
#define MML_TDC_CLKR_HPOL_LOW					0 //!< HSYNC active low
#define MML_TDC_CLKR_HPOL_HIGH					1 //!< HSYNC active high
#define MML_TDC_CLKR_EDGE_LOW					0 //!< data latched on the rising clock edge
#define MML_TDC_CLKR_EDGE_HIGH					1 //!< data latched on the falling clock edge
#define MML_TDC_CLKR_PASCLK_ACTIVE				0 //!< for TFT panel
#define MML_TDC_CLKR_PASCLK_PASSIVE				1 //!< for STN panel
#define MML_TDC_CLKR_VSCANDIR_NORMAL			0 //!< left to right scan
#define MML_TDC_CLKR_VSCANDIR_INVERT			1 //!< right to left scan
#define MML_TDC_CLKR_HSCANDIR_NORMAL			0 //!< up to down scan
#define MML_TDC_CLKR_HSCANDIR_INVERT			1 //!< down to up scan
/** @} */ /* @defgroup MML_TDC_REGS_CLKR */


/** @defgroup MML_TDC_REGS_VTIMR0 Vertical Timing Register 0 (VTIMR0)
 *
 * @li VLINES [11:0]		- R/W: vertical lines number
 * @li RFU1 [15:12]			- R: reserved
 * @li VBACKPORCH [23:16]	- R/W: vertical back porch lines number
 * @li RFU2 [31:24]			- R: reserved
 *
 * @{
 */

