quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_tdc_regs.h
#define MML_TDC_VTIMR0_OFST						0x4 //!< Register offset
#define MML_TDC_VTIMR0_DFLT						0x0 //!< Register default value

/** Bits Fields */
#define MML_TDC_VTIMR0_VLINES_OFST				0 //!< lines number offset
#define MML_TDC_VTIMR0_VLINES_MASK_NOOFST		0xfff //!< lines number mask
#define MML_TDC_VTIMR0_VLINES_MASK				( MML_TDC_VTIMR0_VLINES_MASK_NOOFST << MML_TDC_VTIMR0_VLINES_OFST ) //!< lines number mask

#define MML_TDC_VTIMR0_RFU1_OFST				12 //!< reserved 1 offset
#define MML_TDC_VTIMR0_RFU1_MASK				0xf000 //!< reserved 1 mask

#define MML_TDC_VTIMR0_VBACKPORCH_OFST			16 //!< vertical back porch lines number offset
#define MML_TDC_VTIMR0_VBACKPORCH_MASK_NOOFST	0xff //!< vertical back porch lines number mask
#define MML_TDC_VTIMR0_VBACKPORCH_MASK			( MML_TDC_VTIMR0_VBACKPORCH_MASK_NOOFST << MML_TDC_VTIMR0_VBACKPORCH_OFST ) //!< vertical back porch lines number mask

#define MML_TDC_VTIMR0_RFU2_OFST				24 //!< reserved 2 offset
#define MML_TDC_VTIMR0_RFU2_MASK				0xff000000 //!< reserved 2 mask

/** @} */ /* @defgroup MML_TDC_REGS_VTIMR0 */


/** @defgroup MML_TDC_REGS_VTIMR1 Vertical Timing Register 1 (VTIMR1)
 *
 * @li VSYNCWIDTH [7:0]		- R/W: VSYNC pulse lines number
 * @li RFU1 [15:8]			- R: reserved
 * @li VFRONTPORCH [23:16]	- R/W: vertical front porch lines number
 * @li RFU2 [31:24]			- R: reserved
 *
 * @{
 */

#define MML_TDC_VTIMR1_OFST						0x8 //!< Register offset
#define MML_TDC_VTIMR1_DFLT						0x0 //!< Register default value

/* Bits Fields */
#define MML_TDC_VTIMR1_VSYNCWIDTH_OFST			0 //!< VSYNC pulse lines number offset
#define MML_TDC_VTIMR1_VSYNCWIDTH_MASK_NOOFST	0xff //!< VSYNC pulse lines number mask
#define MML_TDC_VTIMR1_VSYNCWIDTH_MASK			(  <<  ) //!< VSYNC pulse lines number mask

#define MML_TDC_VTIMR1_RFU1_OFST				8 //!< reserved 1 offset
#define MML_TDC_VTIMR1_RFU1_MASK				0xff00 //!< reserved 1 mask

#define MML_TDC_VTIMR1_VFRONTPORCH_OFST			16 //!< vertical front porch lines number offset
#define MML_TDC_VTIMR1_VFRONTPORCH_MASK_NOOFST	0xff //!< vertical front porch lines number mask
#define MML_TDC_VTIMR1_VFRONTPORCH_MASK			( MML_TDC_VTIMR1_VFRONTPORCH_MASK_NOOFST << MML_TDC_VTIMR1_VFRONTPORCH_OFST ) //!< vertical front porch lines number mask

#define MML_TDC_VTIMR1_RFU2_OFST				24 //!< reserved 2 offset
#define MML_TDC_VTIMR1_RFU2_MASK				0xff000000 //!< reserved 2 mask

/** @} */ /* @defgroup MML_TDC_REGS_VTIMR1 */


/** @defgroup MML_TDC_REGS_HTIMR Horizontal Timing Register (HTIMR)
 *
 * @li HSYNCWIDTH [7:0]		- R/W: HSYNC width in clock cycles
 * @li HFRONTPORCH [15:8]	- R/W: horizontal front porch clocks number
 * @li HSIZE [23:16]		- R/W: the number of pixels per line
 * @li HBACKPORCH [31:24]	- R/W: the horizontal back porch width in clocks cycles
 *
 * @{
 */

#define MML_TDC_HTIMR_OFST						0xc	//!< Register offset
#define MML_TDC_HTIMR_DFLT						0x0	//!< Register default value

/* Bits Fields */
#define MML_TDC_HTIMR_HSYNCWIDTH_OFST			0 //!< HSYNC pulse clock number offset
#define MML_TDC_HTIMR_HSYNCWIDTH_MASK_NOOFST	0xff //!< HSYNC pulse clock number mask
#define MML_TDC_HTIMR_HSYNCWIDTH_MASK			( MML_TDC_HTIMR_HSYNCWIDTH_MASK_NOOFST << MML_TDC_HTIMR_HSYNCWIDTH_OFST ) //!< HSYNC pulse clock number mask

#define MML_TDC_HTIMR_HFRONTPORCH_OFST			8 //!< horizontal front porch lines number offset
#define MML_TDC_HTIMR_HFRONTPORCH_MASK_NOOFST	0xff //!< horizontal front porch lines number mask
#define MML_TDC_HTIMR_HFRONTPORCH_MASK			( MML_TDC_HTIMR_HFRONTPORCH_MASK_NOOFST << MML_TDC_HTIMR_HFRONTPORCH_OFST ) //!< horizontal front porch lines number mask

#define MML_TDC_HTIMR_HSIZE_OFST				16 //!< number of pixel per line offset
#define MML_TDC_HTIMR_HSIZE_MASK_NOOFST			0xff //!< number of pixel per line mask
#define MML_TDC_HTIMR_HSIZE_MASK				( MML_TDC_HTIMR_HSIZE_MASK_NOOFST << MML_TDC_HTIMR_HSIZE_OFST ) //!< number of pixel per line mask

#define MML_TDC_HTIMR_HBACKPORCH_OFST			24 //!< horizontal back porch lines number offset
#define MML_TDC_HTIMR_HBACKPORCH_MASK_NOOFST	0xff //!< horizontal back porch lines number mask
#define MML_TDC_HTIMR_HBACKPORCH_MASK			( MML_TDC_HTIMR_HBACKPORCH_MASK_NOOFST << MML_TDC_HTIMR_HBACKPORCH_OFST ) //!< horizontal back porch lines number mask

/** @} */ /* @defgroup MML_TDC_REGS_HTIMR */


/** @defgroup MML_TDC_REGS_CR Control Register (CR)
 *
 * @li LCDEN [0]		- R/W: LCD enable
 * @li VISEL [2:1]		- R/W: vertical compare interrupt select
 * @li RFU1 [3]			- R: reserved
 * @li DISTYPE [7:4]	- R/W: display type
 * @li BPP [10:8]		- R/W: bit per pixel
 * @li RFU2 [11]		- R: reserved
 * @li EMODE [13:12]	- R/W: endianess
 * @li RFU3 [14]		- R: reserved
 * @li C24 [15]			- R/W: compact storage mode
 * @li RFU4 [18:16]		- R: reserved
 * @li BURST [20:19]	- R/W: FIFO burst size
 * @li LPOL [21]		- R/W: LEND polarity
 * @li PEN [22]			- R/W: LCD panel power enable
 * @li RFU5 [31:23]		- R: reserved
 *
 * @{
 */

#define MML_TDC_CR_OFST							0x10 //!< Register offset
#define MML_TDC_CR_DFLT							0x0 //!< Register default value

/* Bits Fields */
#define MML_TDC_CR_LCDEN_OFST					0 //!< LCD enable offset
#define MML_TDC_CR_LCDEN_MASK_NOOFST			0x1 //!< LCD enable mask
#define MML_TDC_CR_LCDEN_MASK					( MML_TDC_CR_LCDEN_MASK_NOOFST << MML_TDC_CR_LCDEN_OFST ) //!< LCD enable mask

#define MML_TDC_CR_VISEL_OFST					1 //!< vertical compare interrupt select offset
#define MML_TDC_CR_VISEL_MASK_NOOFST			0x3 //!< vertical compare interrupt select mask
#define MML_TDC_CR_VISEL_MASK					( MML_TDC_CR_VISEL_MASK_NOOFST << MML_TDC_CR_VISEL_OFST ) //!< vertical compare interrupt select mask

#define MML_TDC_CR_RFU1_OFST					3 //!< reserved 1 offset
#define MML_TDC_CR_RFU1_MASK					0x8 //!< reserved 1 mask

#define MML_TDC_CR_DISTYPE_OFST					4 //!< display type offset
#define MML_TDC_CR_DISTYPE_MASK_NOOFST			0xf //!< display type mask
#define MML_TDC_CR_DISTYPE_MASK					( MML_TDC_CR_DISTYPE_MASK_NOOFST << MML_TDC_CR_DISTYPE_OFST ) //!< display type mask

#define MML_TDC_CR_BPP_OFST						8 //!< bit per pixel offset
#define MML_TDC_CR_BPP_MASK_NOOFST				0x7 //!< bit per pixel mask
#define MML_TDC_CR_BPP_MASK						( MML_TDC_CR_BPP_MASK_NOOFST << MML_TDC_CR_BPP_OFST ) //!< bit per pixel mask

#define MML_TDC_CR_RFU2_OFST					11 //!< reserved 2 offset
#define MML_TDC_CR_RFU2_MASK					0x800 //!< reserved 2 mask

