quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_tdc_regs.h
#define MML_TDC_CR_EMODE_OFST					12 //!< endianess offset
#define MML_TDC_CR_EMODE_MASK_NOOFST			0x3 //!< endianess mask
#define MML_TDC_CR_EMODE_MASK					( MML_TDC_CR_EMODE_MASK_NOOFST << MML_TDC_CR_EMODE_OFST ) //!< endianess mask

#define MML_TDC_CR_RFU3_OFST					14 //!< reserved 3 offset
#define MML_TDC_CR_RFU3_MASK					0x4000 //!< reserved 3 mask

#define MML_TDC_CR_C24_OFST						15 //!< compact storage mode offset
#define MML_TDC_CR_C24_MASK_NOOFST				0x1 //!< compact storage mode mask
#define MML_TDC_CR_C24_MASK						( MML_TDC_CR_C24_MASK_NOOFST << MML_TDC_CR_C24_OFST ) //!< compact storage mode mask

#define MML_TDC_CR_RFU4_OFST					16 //!< reserved 4 offset
#define MML_TDC_CR_RFU4_MASK					0x70000 //!< reserved 4 mask

#define MML_TDC_CR_BURST_OFST					19 //!< FIFO burst size offset
#define MML_TDC_CR_BURST_MASK_NOOFST			0x3 //!< FIFO burst size mask
#define MML_TDC_CR_BURST_MASK					( MML_TDC_CR_BURST_MASK_NOOFST << MML_TDC_CR_BURST_OFST ) //!< FIFO burst size mask

#define MML_TDC_CR_LPOL_OFST					21 //!< LEND polarity offset
#define MML_TDC_CR_LPOL_MASK_NOOFST				0x1 //!< LEND polarity mask
#define MML_TDC_CR_LPOL_MASK					( MML_TDC_CR_LPOL_MASK_NOOFST << MML_TDC_CR_LPOL_OFST ) //!< LEND polarity mask

#define MML_TDC_CR_PEN_OFST						22 //!< LCD panel power enable offset
#define MML_TDC_CR_PEN_MASK_NOOFST				0x1 //!< LCD panel power enable mask
#define MML_TDC_CR_PEN_MASK						( MML_TDC_CR_PEN_MASK_NOOFST << MML_TDC_CR_PEN_OFST ) //!< LCD panel power enable mask

#define MML_TDC_CR_RFU5_OFST					23 //!< reserved 5 offset
#define MML_TDC_CR_RFU5_MASK					0xff800000 //!< reserved 5 mask





/** Enumeration of the different value for a bits field  */
#define MML_TDC_CR_LCDEN_DISABLE				0 //!< LCD is disable
#define MML_TDC_CR_LCDEN_ENABLE					1 //!< LCD is enable

#define MML_TDC_CR_VISEL_VSYNC					0 //!< VCI start on VSYNC
#define MML_TDC_CR_VISEL_VBACKPORCH				1 //!< VCI start on VSYNC
#define MML_TDC_CR_VISEL_VIDEO_ACTIVE			2 //!< VCI start on VSYNC
#define MML_TDC_CR_VISEL_VFRONTPORCH			3 //!< VCI start on VSYNC

#define MML_TDC_CR_DISTYPE_STN_MONO_4_BIT		0 //!< STN monochrome 4-bit mode
#define MML_TDC_CR_DISTYPE_STN_MONO_4_BIT_DUAL	1 //!< STN monochrome 4-bit dual mode
#define MML_TDC_CR_DISTYPE_STN_MONO_8_BIT		2 //!< STN monochrome 8-bit mode
#define MML_TDC_CR_DISTYPE_STN_MONO_8_BIT_DUAL	3 //!< STN monochrome 8-bit dual mode
#define MML_TDC_CR_DISTYPE_STN_COLOR_8_BIT		4 //!< STN color 8-bit mode
#define MML_TDC_CR_DISTYPE_STN_COLOR_8_BIT_DUAL	5 //!< STN color 8-bit dual mode
#define MML_TDC_CR_DISTYPE_TFT					8 //!< TFT mode
#define MML_TDC_CR_DISTYPE_HRTFT				9 //!< HRTFT mode

#define MML_TDC_CR_BPP_1						0 //!< 1 bit per pixel
#define MML_TDC_CR_BPP_2						1 //!< 2 bit per pixel
#define MML_TDC_CR_BPP_4						2 //!< 4 bit per pixel
#define MML_TDC_CR_BPP_8						3 //!< 8 bit per pixel
#define MML_TDC_CR_BPP_16						4 //!< 16 bit per pixel
#define MML_TDC_CR_BPP_24						5 //!< 24 bit per pixel

#define MML_TDC_CR_EMODE_LBLP					0 //!< Little Endian Byte Little Endian Pixel mode
#define MML_TDC_CR_EMODE_BBBP					1 //!< Big Endian Byte Big Endian Pixel mode
#define MML_TDC_CR_EMODE_LBBP					2 //!< Little Endian Byte, Big Endian Pixel mode (WinCE format)

#define MML_TDC_CR_C24_DISABLE					0 //!< 1 pixel per word
#define MML_TDC_CR_C24_ENABLE					1 //!< 1 1/3 pixel per word

#define MML_TDC_CR_BURST_4						0 //!< FIFO burst size is 4 words
#define MML_TDC_CR_BURST_8						1 //!< FIFO burst size is 8 words
#define MML_TDC_CR_BURST_16_1					2 //!< FIFO burst size is 16 words
#define MML_TDC_CR_BURST_16_2					3 //!< FIFO burst size is 16 words

#define MML_TDC_CR_LPOL_LOW						0 //!< LEND is active low
#define MML_TDC_CR_LPOL_HIGH					1 //!< LEND is active high

#define MML_TDC_CR_PEN_DISABLE					0 //!< PWREN pin set to 0
#define MML_TDC_CR_PEN_ENABLE					1 //!< PWREN pin set to 1

/** @} */ /* @defgroup MML_TDC_REGS_CR */


/** @defgroup MML_TDC_REGS_FRMBR0 Frame Buffer Register 0 (FRMBR0)
 *
 * @li ADDRESS [31:0]		- R/W: starting address of the frame buffer 0
 *
 * @{
 */

#define MML_TDC_FRMBR0_OFST						0x18 //!< Register offset
#define MML_TDC_FRMBR0_DFLT						0x0 //!< Register default value

/** @} */ /* @defgroup MML_TDC_REGS_FRMBR0 */


/** @defgroup MML_TDC_REGS_FRMBR1 Frame Buffer Register 1 (FRMBR1)
 *
 * @li ADDRESS [31:0]		- R/W: starting address of the frame buffer 1
 *
 * @{
 */

#define MML_TDC_FRMBR1_OFST						0x1c //!< Register offset
#define MML_TDC_FRMBR1_DFLT						0x0 //!< Register default value

/** @} */ /* @defgroup MML_TDC_REGS_FRMBR1 */


/** @defgroup MML_TDC_REGS_IER Interrupt Enable Register (IER)
 *
 * @li UFLO [0]		- R/W: FIFO underflow interrupt enable
 * @li ADDRDY [1]	- R/W: address ready interrupt enable
 * @li VCI [2]		- R/W: vertical control interrupt enable
 * @li BERR [3]		- R/W: bus error interrupt enable
 * @li RFU [31:4]	- R: reserved
 *
 * @{
 */

#define MML_TDC_IER_OFST						0x20 //!< Register offset
#define MML_TDC_IER_DFLT						0x0 //!< Register default value

/* Bits Fields */
#define MML_TDC_IER_UFLO_OFST					0 //!< FIFO underflow interrupt enable offset
#define MML_TDC_IER_UFLO_MASK_NOOFST	 		0x1 //!< FIFO underflow interrupt enable mask
#define MML_TDC_IER_UFLO_MASK	 				( MML_TDC_IER_UFLO_MASK_NOOFST << MML_TDC_IER_UFLO_OFST ) //!< FIFO underflow interrupt enable mask

#define MML_TDC_IER_ADDRDY_OFST					1	//!< address ready interrupt enable offset
#define MML_TDC_IER_ADDRDY_MASK_NOOFST			0x1	//!< address ready interrupt enable mask
#define MML_TDC_IER_ADDRDY_MASK					( MML_TDC_IER_ADDRDY_MASK_NOOFST << MML_TDC_IER_ADDRDY_OFST ) //!< address ready interrupt enable mask

#define MML_TDC_IER_VCI_OFST					2 //!< vertical control interrupt enable offset
#define MML_TDC_IER_VCI_MASK_NOOFST				0x1	//!< vertical control interrupt enable mask
#define MML_TDC_IER_VCI_MASK					( MML_TDC_IER_VCI_MASK_NOOFST << MML_TDC_IER_VCI_OFST ) //!< vertical control interrupt enable mask

#define MML_TDC_IER_BERR_OFST					3 //!< bus error interrupt enable offset
#define MML_TDC_IER_BERR_MASK_NOOFST			0x1	//!< bus error interrupt enable mask
#define MML_TDC_IER_BERR_MASK					( MML_TDC_IER_BERR_MASK_NOOFST << MML_TDC_IER_BERR_OFST ) //!< bus error interrupt enable mask

#define MML_TDC_IER_RFU_OFST					4 //!< reserved offset
#define MML_TDC_IER_RFU_MASK					0xfffffff0 //!< reserved mask

