quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_tdc_regs.h
#define MML_TDC_IER_UFLO_DISABLE				0 //!< FIFO underflow interrupt disable
#define MML_TDC_IER_UFLO_ENABLE					1 //!< FIFO underflow interrupt enable

#define MML_TDC_IER_ADDRDY_DISABLE				0 //!< address ready interrupt disable
#define MML_TDC_IER_ADDRDY_ENABLE				1 //!< address ready interrupt enable

#define MML_TDC_IER_VCI_DISABLE					0 //!< vertical control interrupt disable
#define MML_TDC_IER_VCI_ENABLE					1 //!< vertical control interrupt enable

#define MML_TDC_IER_BERR_DISABLE				0 //!< bus error interrupt disable
#define MML_TDC_IER_BERR_ENABLE					1 //!< bus error interrupt enable

/** @} */ /* @defgroup MML_TDC_REGS_IER */


/** @defgroup MML_TDC_REGS_SR Status Register (SR)
 *
 * @li UFLO [0]		- R: FIFO underflow interrupt status
 * @li ADDRDY [1]	- R: address ready interrupt status
 * @li VCI [2]		- R: vertical control interrupt status
 * @li BERR [3]		- R: bus error interrupt status
 * @li RFU1 [7:4]	- R: reserved
 * @li LCD_IDLE [8]	- R: LCD status : 0-> running, 1-> idle
 * @li RFU2 [31:9]	- R: reserved
 *
 * @{
 */

#define MML_TDC_SR_OFST							0x24 //!< Register offset
#define MML_TDC_SR_DFLT							0x0 //!< Register default value

/* Bits Fields */
#define MML_TDC_SR_UFLO_OFST					0 //!< FIFO underflow interrupt status offset
#define MML_TDC_SR_UFLO_MASK_NOOFST				0x1 //!< FIFO underflow interrupt enable mask
#define MML_TDC_SR_UFLO_MASK					( MML_TDC_SR_UFLO_MASK_NOOFST << MML_TDC_SR_UFLO_OFST ) //!< FIFO underflow interrupt enable mask

#define MML_TDC_SR_ADDRDY_OFST					1 //!< address ready interrupt status offset
#define MML_TDC_SR_ADDRDY_MASK_NOOFST			0x1 //!< address ready interrupt enable mask
#define MML_TDC_SR_ADDRDY_MASK					( MML_TDC_SR_ADDRDY_MASK_NOOFST << MML_TDC_SR_ADDRDY_OFST ) //!< address ready interrupt enable mask

#define MML_TDC_SR_VCI_OFST						2 //!< vertical control interrupt status offset
#define MML_TDC_SR_VCI_MASK_NOOFST				0x1 //!< vertical control interrupt enable mask
#define MML_TDC_SR_VCI_MASK						( MML_TDC_SR_VCI_MASK_NOOFST << MML_TDC_SR_VCI_OFST ) //!< vertical control interrupt enable mask

#define MML_TDC_SR_BERR_OFST					3 //!< bus error interrupt status offset
#define MML_TDC_SR_BERR_MASK_NOOFST				0x1 //!< bus error interrupt enable mask
#define MML_TDC_SR_BERR_MASK					( MML_TDC_SR_BERR_MASK_NOOFST << MML_TDC_SR_BERR_OFST ) //!< bus error interrupt enable mask

#define MML_TDC_SR_RFU1_OFST					4 //!< reserved 1 offset
#define MML_TDC_SR_RFU1_MASK					0xf0 //!< reserved 1 mask

#define MML_TDC_SR_LCD_IDLE_OFST				8 //!< LCD status offset
#define MML_TDC_SR_LCD_IDLE_MASK_NOOFST			0x1 //!< LCD status mask
#define MML_TDC_SR_LCD_IDLE_MASK				( MML_TDC_SR_LCD_IDLE_MASK_NOOFST << MML_TDC_SR_LCD_IDLE_OFST ) //!< LCD status mask

#define MML_TDC_SR_RFU2_OFST					9 //!< reserved 2 offset
#define MML_TDC_SR_RFU2_MASK					0xfffffe00 //!< reserved 2 mask

/** @} */ /* @defgroup MML_TDC_REGS_SR */


/** @defgroup MML_TDC_REGS_ADVTIMR Advanced Timing Register (ADVTIMR)
 *
 * @li CLS_WIDTH [8:0]		- R/W: CLS width
 * @li RFU1 [15:9]			- R: reserved
 * @li REV_DLY [24:16]		- R/W: CLS falling edge to REV toggling
 * @li RFU2 [25]			- R: reserved
 * @li PS_HOLD_TIME [31:26]	- R/W: CLS falling edge to PS rising edge
 *
 * @{
 */

#define MML_TDC_ADVTIMR_OFST					0x28 //!< Register offset
#define MML_TDC_ADVTIMR_DFLT					0x0//!< Register default value

/* Bits Fields */
#define MML_TDC_ADVTIMR_CLS_WIDTH_OFST			0 //!< CLS_WIDTH offset
#define MML_TDC_ADVTIMR_CLS_WIDTH_MASK_NOOFST	0x1ff //!< CLS_WIDTH mask
#define MML_TDC_ADVTIMR_CLS_WIDTH_MASK			( MML_TDC_ADVTIMR_CLS_WIDTH_MASK_NOOFST << MML_TDC_ADVTIMR_CLS_WIDTH_OFST ) //!< CLS_WIDTH mask

#define MML_TDC_ADVTIMR_RFU1_OFST				9 //!< reserved 1 offset
#define MML_TDC_ADVTIMR_RFU1_MASK				0xfe00 //!< reserved 1 mask

#define MML_TDC_ADVTIMR_REV_DLY_OFST			16 //!< REV_DLY offset
#define MML_TDC_ADVTIMR_REV_DLY_MASK_NOOFST	0x1ff //!< REV_DLY mask
#define MML_TDC_ADVTIMR_REV_DLY_MASK			( MML_TDC_ADVTIMR_REV_DLY_MASK_NOOFST << MML_TDC_ADVTIMR_REV_DLY_OFST ) //!< REV_DLY mask

#define MML_TDC_ADVTIMR_RFU2_OFST				25 //!< reserved 2 offset
#define MML_TDC_ADVTIMR_RFU2_MASK				0x2000000 //!< reserved 2 mask

#define MML_TDC_ADVTIMR_PS_HOLD_TIME_OFST		26 //!< PS_HOLD_TIME offset
#define MML_TDC_ADVTIMR_PS_HOLD_TIME_MASK_NOOFST	0x3f //!< PS_HOLD_TIME mask
#define MML_TDC_ADVTIMR_PS_HOLD_TIME_MASK		( MML_TDC_ADVTIMR_PS_HOLD_TIME_MASK_NOOFST << MML_TDC_ADVTIMR_PS_HOLD_TIME_OFST ) //!< PS_HOLD_TIME mask

/** @} */ /* @defgroup MML_TDC_REGS_ADVTIMR */


/** @defgroup MML_TDC_REGS_PALR Palette Register (PALR)
 *
 * @li INTS [0]			- R/W: intensity
 * @li RED [5:1]		- R/W: red data
 * @li GREEN [10:6]		- R/W: green data
 * @li BLUE [15:11]		- R/W: blue data
 * @li INTS [16]		- R/W: intensity
 * @li RED [21:17]		- R/W: red data
 * @li GREEN [26:22]	- R/W: green data
 * @li BLUE [27]		- R/W: blue data
 *
 * @{
 */

#define MML_TDC_PALR_OFST						0x30 //!< 1st Register offset
#define MML_TDC_PALR_DEPTH						0x100 //!< depth of the palette RAM
#define MML_TDC_PALR_DFLT						0x0 //!< Register default value

#define MML_TDC_PALR_INTS0_OFST					0 //!< INTS0 offset
#define MML_TDC_PALR_INTS0_MASK_NOOFST			0x1 //!< INTS0 mask
#define MML_TDC_PALR_INTS0_MASK					( MML_TDC_PALR_INTS0_MASK_NOOFST << MML_TDC_PALR_INTS0_OFST ) //!< INTS0 mask

#define MML_TDC_PALR_RED0_OFST					1 //!< RED0 offset
#define MML_TDC_PALR_RED0_MASK_NOOFST			0x1f //!< RED0 mask
#define MML_TDC_PALR_RED0_MASK					( MML_TDC_PALR_RED0_MASK_NOOFST << MML_TDC_PALR_RED0_MASK_NOOFST ) //!< RED0 mask

#define MML_TDC_PALR_GREEN0_OFST				6 //!< GREEN0 offset
#define MML_TDC_PALR_GREEN0_MASK_NOOFST			0x1f //!< GREEN0 mask
#define MML_TDC_PALR_GREEN0_MASK				( MML_TDC_PALR_GREEN0_MASK_NOOFST << MML_TDC_PALR_GREEN0_OFST ) //!< GREEN0 mask

#define MML_TDC_PALR_BLUE0_OFST					11 //!< BLUE0 offset
#define MML_TDC_PALR_BLUE0_MASK_NOOFST			0x1f //!< BLUE0 mask
#define MML_TDC_PALR_BLUE0_MASK					( MML_TDC_PALR_BLUE0_MASK_NOOFST << MML_TDC_PALR_BLUE0_OFST ) //!< BLUE0 mask

#define MML_TDC_PALR_INTS1_OFST					16 //!< INTS1 offset
#define MML_TDC_PALR_INTS1_MASK_NOOFST			0x1 //!< INTS1 mask
#define MML_TDC_PALR_INTS1_MASK					( MML_TDC_PALR_INTS1_MASK_NOOFST << MML_TDC_PALR_INTS1_OFST ) //!< INTS1 mask

#define MML_TDC_PALR_RED1_OFST					17 //!< RED1 offset
#define MML_TDC_PALR_RED1_MASK_NOOFST			0x1f //!< RED1 mask
#define MML_TDC_PALR_RED1_MASK					( MML_TDC_PALR_RED1_MASK_NOOFST << MML_TDC_PALR_RED1_OFST ) //!< RED1 mask

#define MML_TDC_PALR_GREEN1_OFST				22 //!< GREEN1 offset
#define MML_TDC_PALR_GREEN1_MASK_NOOFST			0x1f //!< GREEN1 mask
#define MML_TDC_PALR_GREEN1_MASK				( MML_TDC_PALR_GREEN1_MASK_NOOFST << MML_TDC_PALR_GREEN1_OFST ) //!< GREEN1 mask

#define MML_TDC_PALR_BLUE1_OFST					27 //!< BLUE1 offset
#define MML_TDC_PALR_BLUE1_MASK_NOOFST			0x1f //!< BLUE1 mask
#define MML_TDC_PALR_BLUE1_MASK					( MML_TDC_PALR_BLUE1_MASK_NOOFST << MML_TDC_PALR_BLUE1_OFST ) //!< BLUE1 mask
/** @} */ /* @defgroup MML_TDC_REGS_PALR */

#ifndef __ASSEMBLER__
/* -------------------------------------------------------------------------- */
/** TDC Registers.
 *
 */
typedef volatile struct
{
	volatile unsigned int						clock; //< clock register
	volatile unsigned int						vtim0; //< vertical timing 0 register
	volatile unsigned int						vtim1; //< vertical timing 1 register
	volatile unsigned int						htim1; //< horizontal timing register
	volatile unsigned int						control; //< control register
	volatile unsigned int						rsvd0; //< RSVD0
	volatile unsigned int						fbuffer0; //< frame buffer 0 register
	volatile unsigned int						fbuffer1; //< frame buffer 1 register
	volatile unsigned int						interrupt; //< interrupt mask register
	volatile unsigned int						status; //< status register
	volatile unsigned int						advtim; //< HRTFT timing register
	volatile unsigned int						trek; //< Trusted Entery Key Reg
	volatile unsigned int						thv; //< HSYNC-VSYNC phase Register
	volatile unsigned int						rsvd1[243]; //< RSVD1 unmapped
	volatile unsigned int						palette[256]; //< palette RAM register OFFST=400H

} mml_tdc_regs_t;


#endif /* __ASSEMBLER__ */

/** @} */ /* @defgroup MML_TDC_REGS */

#endif /* _MML_TDC_REGS_H_ */

/******************************************************************************/
/* EOF */
